export const profile = {
  name: "YUKI ITO",
  bio: [
    "１９９３年宮城県仙台市生まれ。",
    "大学卒業後はアルバイトでゲームデバッガーを経験した後、WEB系開発企業でバックエンドエンジニアとして３年間勤務。",
    "在職中はCakePHP4やWordpressを使ってWEBアプリやWEBサイトの改修や実装を行ってきました。",
    "2022年冬にエンジニアを退職したタイミングで、WEBデザイナーに転身。",
  ],
  portrait: "/images/profile/portrait.png",
  skills: [
    {
      heading: "DEVELOPMENT",
      body: [
        "WordpressやCakephp4等のフレームワークを、用途によって使い分けながらサイトを構築していきます。",
        "何を目的に実装するのかをしっかりと考え抜いた上で、長く運用していけるような保守性の高いシステム作りを意識しています。",
        "基本的には小～中規模程度の開発を想定しています。",
      ],
    },
    {
      heading: "DESIGN",
      body: [
        "デザインで達成したい目的をきちんとヒアリング・検討したうえで、狙いに沿ったデザインを作成していきます。",
        "WEBデザインでは上記に加え、フロントエンド開発を効率的に行えるような組み方を意識した上で、UX(ユーザーが実際に利用した際の快適性)を意識したデザインを心がけています。",
      ],
    },
    {
      heading: "HISTORY",
      body: [
        "2016　4年制の情報系大学を卒業",
        "2016　某大手ゲームデバッグ会社に勤務",
        "2018　WEB系開発会社にプログラマとして入社",
        "2023　WEBデザイナーへ転身",
      ],
    },
  ],
} as const;
